Revit 2027 API
Entity.Set Method
Overload List
Name | Description
Set<FieldType>(Field, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
Top
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace